# install: brew bundle install --no-lock
# sync system with brewfile: brew bundle --force cleanup
# create new brewfile from existing system: brew bundle dump --describe

cask_args appdir: "/Applications"

# taps
#tap "azure/functions"
tap "azure/bicep"
tap "homebrew/bundle"
tap "homebrew/cask"
#tap "homebrew/cask-versions"
#tap "homebrew/core"
#tap "snyk/tap"

brew "azure-cli" # Microsoft Azure CLI 2.0
#brew "act" # Run your GitHub Actions locally
#brew "awscli" # Official Amazon AWS command-line interface
#brew "azcopy" # Azure Storage data transfer utility
#brew "gh" # GitHub command-line tool
brew "jandedobbeleer/oh-my-posh/oh-my-posh" # Prompt theme engine for any shell
#brew "jq" # Lightweight and flexible command-line JSON processor
brew "nano" # Free (GNU) replacement for the Pico text editor
brew "mas" # Mac App Store command-line interface
brew "bicep" # Azure bicep
brew "sops"
#brew "azure/functions/azure-functions-core-tools@4" # Azure Functions Core Tools
#brew "snyk/tap/snyk" # Find & fix known vulnerabilities in open-source dependencies

cask "1password"
cask "1password-cli"
cask "appcleaner"
cask "brave-browser"
cask "docker"
cask "font-caskaydia-cove-nerd-font"
cask "hiddenbar"
cask "itsycal"
cask "microsoft-auto-update"
cask "microsoft-azure-storage-explorer"
#cask "microsoft-remote-desktop"
cask "postman"
cask "powershell"
cask "rectangle"
#cask "session-manager-plugin"
cask "visual-studio-code"

mas "1Password for Safari", id: 1569813296
