# install: brew bundle install --no-lock
# sync system with brewfile: brew bundle --force cleanup
# create new brewfile from existing system: brew bundle dump --describe

####################

cask_args appdir: "~/Applications"

tap "homebrew/bundle"

brew "ansible" # Automate deployment, configuration, and upgrading
brew "ansible-lint" # Checks ansible playbooks for practices and behaviour
brew "ffmpeg" # Play, record, convert, and stream audio and video (used by yt-dlp)
brew "nano" # Free (GNU) replacement for the Pico text editor
brew "mas" # Mac App Store command-line interface
brew "restic" # Fast, efficient and secure backup program
brew "yt-dlp" # Fork of youtube-dl with additional features and fixes

cask "appcleaner"
cask "balenaetcher"
cask "docker"
cask "iina"
cask "itsycal"
cask "rectangle"
cask "visual-studio-code"

mas "Eno From Capital One", id: 1590422864
mas "iMovie", id: 408981434
mas "Mela", id: 1568924476
mas "Prologue", id: 1459223267
mas "Reeder", id: 1529448980
mas "Tailscale", id: 1475387142
mas "WebSSH", id: 497714887
