# install: brew bundle install --no-lock
# sync system with brewfile: brew bundle --force cleanup
# create new brewfile from existing system: brew bundle dump --describe

cask_args appdir: "/Applications"

# taps
tap "azure/functions"
tap "azure/bicep"
tap "homebrew/bundle"
#tap "homebrew/cask"
#tap "homebrew/cask-versions"
#tap "homebrew/core"
tap "snyk/tap"

# Run your GitHub Actions locally
brew "act"
# Official Amazon AWS command-line interface
brew "awscli"
# Azure Storage data transfer utility
brew "azcopy"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Mac App Store command-line interface
brew "mas"
# Azure bicep
brew "bicep"
# Azure Functions Core Tools 4.0
brew "azure/functions/azure-functions-core-tools@4"
# Find & fix known vulnerabilities in open-source dependencies
brew "snyk/tap/snyk"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Application uninstaller
cask "appcleaner"
# Tool to flash OS images to SD cards & USB drives
cask "brave-browser"
# App to build and share containerized applications and microservices
cask "docker"
# Web browser
cask "hiddenbar"
# Menu bar calendar
cask "itsycal"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Explorer for Azure Storage
cask "microsoft-azure-storage-explorer"
# Collaboration platform for API development
cask "postman"
# Command-line shell and scripting language
cask "powershell"
# Centralizes all remote connections on a single platform
cask "remote-desktop-manager"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Open-source code editor
cask "visual-studio-code"
