tap "azure/bicep"
tap "homebrew/bundle"
tap "jandedobbeleer/oh-my-posh"

# Microsoft Azure CLI 2.0
brew "azure-cli"
# Mac App Store command-line interface
brew "mas"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Bicep: next generation template language for Azure Resource Manager (ARM)
brew "azure/bicep/bicep"
# Prompt theme engine for any shell
brew "jandedobbeleer/oh-my-posh/oh-my-posh"

# Application uninstaller
cask "appcleaner", args: { appdir: "/Applications" }
# Web browser focusing on privacy
cask "brave-browser", args: { appdir: "/Applications" }
# App to build and share containerised applications and microservices
cask "docker-desktop", args: { appdir: "/Applications" }
# Menu bar calendar
cask "itsycal", args: { appdir: "/Applications" }
# Password manager application and digital vault
cask "keeper-password-manager"
# Explorer for Azure Storage
cask "microsoft-azure-storage-explorer", args: { appdir: "/Applications" }
# Command-line shell and scripting language
cask "powershell", args: { appdir: "/Applications" }
# Open-source code editor
cask "visual-studio-code", args: { appdir: "/Applications" }
# Connect to Windows
cask "windows-app"

mas "Reeder", id: 1529448980

vscode "docker.docker"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-azureappservice"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azurestorage"
vscode "ms-azuretools.vscode-azurevirtualmachines"
vscode "ms-azuretools.vscode-bicep"
vscode "ms-azuretools.vscode-containers"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azurecli"
vscode "ms-vscode.live-server"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "redhat.ansible"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "tylerleonhardt.vscode-inline-values-powershell"
